src/app/controllers/allquests_controller.rb

SELECT  "quests".* FROM "quests" ORDER BY id LIMIT $1 OFFSET $2  [["LIMIT", 7], ["OFFSET", 35]]
SELECT COUNT(*) FROM "quests"
---
  def index
    @quests = Quest.all.order('id').paginate(page: params[:page], per_page: 7)

SELECT  "quests".* FROM "quests" WHERE "quests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "users_quests" ("user_id", "quest_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["quest_id", 6], ["status", 1], ["created_at", "2019-04-14 15:36:50.670302"], ["updated_at", "2019-04-14 15:36:50.670302"]]
---
  def new
    #accepting new quest
    puts params[:quest_id]
    quest = Quest.find(params[:quest_id])
    @users_quest = UsersQuest.new(user_id: current_user.id,
                                  quest_id: quest.id, status: 1)
    puts params[:quest_id]
    if @users_quests.save!