src/app/controllers/login_controller.rb

  def create
    user = User.find_by(name: params[:login][:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Sima"], ["LIMIT", 1]]