src/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "quests".* FROM "quests"
---
  def index
    @users = User.all
    @quests = Quest.all

INSERT INTO "quests" ("task", "description", "reward") VALUES ($1, $2, $3) RETURNING "id"  [["task", "dedef"], ["description", "eqfe"], ["reward", 10]]
INSERT INTO "users_quests" ("user_id", "quest_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["quest_id", 47], ["status", 1], ["created_at", "2019-03-30 18:42:24.283051"], ["updated_at", "2019-03-30 18:42:24.283051"]]
INSERT INTO "users_quests" ("user_id", "quest_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["quest_id", 53], ["status", 1], ["created_at", "2019-04-01 12:53:57.115411"], ["updated_at", "2019-04-01 12:53:57.115411"]]
---
  def create
    @quest = Quest.new(quest_params)

    if @quest.save!
      flash[:success] = 'Quest succesfully created'
    else
      flash[:error] = 'error: quest not created'
    end
    @users_quest = UsersQuest.new(user_id: current_user.id,
                                  quest_id: @quest.id, status: 0)
    @users_quest.save
    #tu 1 treba kamsi vytiahnut asi, ale to ma cas na refactor
    # adding quest to myself
    if params[:add_quest_to_mine_quests].eql?('1')
      @users_quest = UsersQuest.new(user_id: current_user.id,
                                    quest_id: @quest.id, status: 1)

      if @users_quest.save!