app/views/users/index.html.erb

  <h3><%=user.name %></h3>
  <% user.quests.each  do |quest|    %>
---
SELECT "quests".* FROM "quests" INNER JOIN "users_quests" ON "quests"."id" = "users_quests"."quest_id" WHERE "users_quests"."user_id" = $1  [["user_id", 2]]