app/views/users/show.html.erb

<h1>Your completed quests:</h1>
<% accepted = current_user.quests.where(:users_quests => {status: '2'}) %>
---
SELECT "quests".* FROM "quests" INNER JOIN "users_quests" ON "quests"."id" = "users_quests"."quest_id" WHERE "users_quests"."user_id" = $1 AND "users_quests"."status" = $2  [["user_id", 1], ["status", 2]]

<h1>Your created quests:</h1>
<% accepted = current_user.quests.where(:users_quests => {status: '0'}) %>
---
SELECT "quests".* FROM "quests" INNER JOIN "users_quests" ON "quests"."id" = "users_quests"."quest_id" WHERE "users_quests"."user_id" = $1 AND "users_quests"."status" = $2  [["user_id", 1], ["status", 2]]