app/controllers/index_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("name", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "majka"], ["password", "mmm"], ["email", "majka@gmail.com"], ["created_at", "2019-03-11 18:21:47.334383"], ["updated_at", "2019-03-11 18:21:47.334383"]]