app/controllers/quests_controller.rb

SELECT  "users_quests".* FROM "users_quests" WHERE "users_quests"."user_id" = $1 AND "users_quests"."quest_id" = $2 AND "users_quests"."status" = $3 ORDER BY "users_quests"."id" ASC LIMIT $4  [["user_id", 1], ["quest_id", 51], ["status", 1], ["LIMIT", 1]]
UPDATE "users_quests" SET "status" = $1, "updated_at" = $2 WHERE "users_quests"."id" = $3  [["status", 2], ["updated_at", "2019-03-30 21:05:32.962666"], ["id", 8]]
---
  def complete
    puts 'completed'
    puts params[:completed_quest_id]

    connection = current_user.users_quests.where(quest_id: params[:completed_quest_id], status: 1).first
    if connection.status.eql?(1)
      connection.status = 2
      connection.save

SELECT  "quests".* FROM "quests" WHERE "quests"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def accept
    #completing quest
    quest = Quest.find(params[:quest_id])