app/controllers/quests_controller.rb

  def complete
    quest = Quest.find(params[:quest_id])
---
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]