app/controllers/users_controller.rb

  def index
    @users = User.all
    @quests = Quest.all
---
SELECT "users".* FROM "users"
SELECT "quests".* FROM "quests"

  def create
    @quest = Quest.new(quest_params)
    @quest.save
    @users_quest = UsersQuest.new(user_id: current_user.id,
                                  quest_id: @quest.id, status: 0)
    @users_quest.save
    #tu 1 treba kamsi vytiahnut asi, ale to ma cas na refactor
    # adding quest to myself
    if params[:add_quest_to_mine_quests].eql?('1')
      @users_quest = UsersQuest.new(user_id: current_user.id,
                                    quest_id: @quest.id, status: 1)
      @users_quest.save
    end
    #sending quest to other user
    if params[:add_quest_to_someone].eql?('1')
      puts params[:other_user_id]
      @users_quest = UsersQuest.new(user_id: params[:other_user_id],
                                    quest_id: @quest.id, status: 1)
      @users_quest.save
---
INSERT INTO "quests" ("task", "description", "reward") VALUES ($1, $2, $3) RETURNING "id"  [["task", "dedef"], ["description", "eqfe"], ["reward", 10]]
INSERT INTO "users_quests" ("user_id", "quest_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["quest_id", 50], ["status", 0], ["created_at", "2019-03-30 20:52:03.420532"], ["updated_at", "2019-03-30 20:52:03.420532"]]
INSERT INTO "users_quests" ("user_id", "quest_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["quest_id", 51], ["status", 1], ["created_at", "2019-03-30 21:06:07.717978"], ["updated_at", "2019-03-30 21:06:07.717978"]]
INSERT INTO "users_quests" ("user_id", "quest_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["quest_id", 49], ["status", 1], ["created_at", "2019-03-30 20:38:42.366311"], ["updated_at", "2019-03-30 20:38:42.366311"]]